In [ ]:
# SET THEORY

# LEFT MERGE
# RIGHT
# INNER
# OUTER

In [6]:
import pandas as pd

stu_data1 = pd.DataFrame({"id" : (1,2,4,6,3,5),
                          "name": ("jaspreet","sneha","olu","rounak","manish","hassan"),
                          "course": ("python","r","sas","tableau","angular","react")})
print(stu_data1)

stu_data2 = pd.DataFrame({"id": (2,1,4,7,8,6),
                          "age": (23,34,32,25,26,27),
                          "address":("kolkata","ca","aus","la","nz","san")})
print(stu_data2)

   id      name   course
0   1  jaspreet   python
1   2     sneha        r
2   4       olu      sas
3   6    rounak  tableau
4   3    manish  angular
5   5    hassan    react
   id  age  address
0   2   23  kolkata
1   1   34       ca
2   4   32      aus
3   7   25       la
4   8   26       nz
5   6   27      san

In [3]:
# SORT THE DATAFRAME

stu_sort1 = stu_data1.sort_values("id")
print(stu_sort1)

stu_sort2 = stu_data2.sort_values("id")
print(stu_sort2)

   id      name   course
0   1  jaspreet   python
1   2     sneha        r
4   3    manish  angular
2   4       olu      sas
5   5    hassan    react
3   6    rounak  tableau
   id  age  address
1   1   34       ca
0   2   23  kolkata
2   4   32      aus
5   6   27      san
3   7   25       la
4   8   26       nz

In [7]:
# LEFT JOIN

left_stu = pd.merge(stu_sort1,
                    stu_sort2, on = "id", how = "left")
print(left_stu)

   id      name   course   age  address
0   1  jaspreet   python  34.0       ca
1   2     sneha        r  23.0  kolkata
2   3    manish  angular   NaN      NaN
3   4       olu      sas  32.0      aus
4   5    hassan    react   NaN      NaN
5   6    rounak  tableau  27.0      san

In [5]:
# RIGHT JOIN

right_stu = pd.merge(stu_sort1,stu_sort2,
                     on = "id", how = "right")

print(right_stu)

   id      name   course  age  address
0   1  jaspreet   python   34       ca
1   2     sneha        r   23  kolkata
2   4       olu      sas   32      aus
3   6    rounak  tableau   27      san
4   7       NaN      NaN   25       la
5   8       NaN      NaN   26       nz

In [8]:
# INNER JOIN

inner_stu = pd.merge(stu_sort1,stu_sort2,
                     on = "id", how = "inner")

print(inner_stu)

   id      name   course  age  address
0   1  jaspreet   python   34       ca
1   2     sneha        r   23  kolkata
2   4       olu      sas   32      aus
3   6    rounak  tableau   27      san

In [9]:
# OUTER JOIN (UNION)

outer_stu = pd.merge(stu_sort1,stu_sort2,
                     on = "id", how = "outer")

print(outer_stu)

   id      name   course   age  address
0   1  jaspreet   python  34.0       ca
1   2     sneha        r  23.0  kolkata
2   3    manish  angular   NaN      NaN
3   4       olu      sas  32.0      aus
4   5    hassan    react   NaN      NaN
5   6    rounak  tableau  27.0      san
6   7       NaN      NaN  25.0       la
7   8       NaN      NaN  26.0       nz